In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [5]:
ser1 = Series(['One','Two',np.nan,'Three'])
ser1

0      One
1      Two
2      NaN
3    Three
dtype: object

In [7]:
ser1.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
ser1.dropna()

0      One
1      Two
3    Three
dtype: object

In [10]:
df1 = DataFrame([[1,2,3],[np.nan,4,5],[7,np.nan,9],[np.nan,np.nan,np.nan]])
df1

    0   1   2
0   1   2   3
1 NaN   4   5
2   7 NaN   9
3 NaN NaN NaN

In [11]:
df1.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [13]:
clean_df = df1.dropna()
clean_df

   0  1  2
0  1  2  3

In [14]:
df1.dropna(how = 'all')

    0   1  2
0   1   2  3
1 NaN   4  5
2   7 NaN  9

In [17]:
df1.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [18]:
df1.dropna(axis = 1,how = 'all')

    0   1   2
0   1   2   3
1 NaN   4   5
2   7 NaN   9
3 NaN NaN NaN

In [19]:
df2 = DataFrame(np.)

    0   1   2
0   1   2   3
1 NaN   4   5
2   7 NaN   9
3 NaN NaN NaN

In [36]:
npn = np.nan
df2 = DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[npn,npn,npn,npn]])
df2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3 NaN NaN NaN NaN

In [37]:
df2.dropna(thresh = 2)

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9

In [40]:
df2.dropna(thresh = 3,axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [41]:
df2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3 NaN NaN NaN NaN

In [44]:
df2.fillna('1')

   0  1  2  3
0  1  2  3  1
1  2  1  5  6
2  1  7  1  9
3  1  1  1  1

In [45]:
df2.fillna('NotApplicable') #NotApplicable is not keyword

               0              1              2              3
0              1              2              3  NotApplicable
1              2  NotApplicable              5              6
2  NotApplicable              7  NotApplicable              9
3  NotApplicable  NotApplicable  NotApplicable  NotApplicable

In [46]:
df2.fillna({0:10,1:11,2:22,3:33})

    0   1   2   3
0   1   2   3  33
1   2  11   5   6
2  10   7  22   9
3  10  11  22  33

In [47]:
df2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3 NaN NaN NaN NaN

In [48]:
df2.fillna(0,inplace = True)

In [49]:
df2

   0  1  2  3
0  1  2  3  0
1  2  0  5  6
2  0  7  0  9
3  0  0  0  0